martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    // Parse argument
    if (strcasecmp(argv[1], "none") == 0 || strcmp(argv[1], "-1") == 0) {
        gpio_num = -1;
    } else {
        char *endptr;
        gpio_num = strtol(argv[1], &endptr, 10);
        if (*endptr != '\0' || gpio_num < 0 || gpio_num > 48) {
            printf("Invalid GPIO number. Use 0-48 or 'none'.\n");
            return 1;
        }
    }

    err = set_config_param_int("led_gpio", gpio_num);
    if (err == ESP_OK) {
        if (gpio_num < 0) {
            ESP_LOGI(TAG, "LED GPIO disabled.");
            printf("LED status blinking disabled.\n");
        } else {
            ESP_LOGI(TAG, "LED GPIO set to %d.", gpio_num);
            printf("LED status blinking set to GPIO %d.\n", gpio_num);
        }
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_led_gpio(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_led_gpio",
        .help = "Set GPIO for status LED blinking (use 'none' to disable)",
        .hint = NULL,
        .func = &set_led_gpio_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_led_lowactive' command - set LED low-active (inverted) mode */
static int set_led_lowactive_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_led_lowactive <true|false>\n");
        printf("  true: LED is active-low (inverted, common for onboard LEDs)\n");
        printf("  false: LED is active-high (default)\n");
        printf("\nCurrent setting: %s\n", led_lowactive ? "true (low-active)" : "false (active-high)");
        return 0;
    }

    esp_err_t err;
    int value;

    // Parse boolean argument
    if (parse_bool_true(argv[1])) {
        value = 1;
    } else if (parse_bool_false(argv[1])) {
        value = 0;
    } else {
        printf("Invalid value. Use true/false.\n");
        return 1;
    }

    err = set_config_param_int("led_low", value);
    if (err == ESP_OK) {
        led_lowactive = value;
        if (value) {
            ESP_LOGI(TAG, "LED set to low-active (inverted) mode.");
            printf("LED set to low-active (inverted) mode.\n");
        } else {
            ESP_LOGI(TAG, "LED set to active-high (normal) mode.");
            printf("LED set to active-high (normal) mode.\n");
        }
        printf("Change takes effect immediately.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_led_lowactive(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_led_lowactive",
        .help = "Set LED to low-active (inverted) mode for active-low LEDs",
        .hint = NULL,
        .func = &set_led_lowactive_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_led_strip' command - set GPIO for addressable LED strip (WS2812) */
static int set_led_strip_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_led_strip <gpio_number|none>\n");
        printf("  gpio_number: GPIO pin for WS2812 data line (0-48)\n");
        printf("  none: disable addressable LED strip\n");
        printf("\nCurrent setting: ");
        if (led_strip_gpio < 0) {
            printf("none (disabled)\n");
        } else {
            printf("GPIO %d\n", led_strip_gpio);
        }
        return 0;
    }

    int gpio_num;
    if (strcasecmp(argv[1], "none") == 0 || strcmp(argv[1], "-1") == 0) {
        gpio_num = -1;
    } else {
        char *endptr;
        gpio_num = strtol(argv[1], &endptr, 10);
        if (*endptr != '\0' || gpio_num < 0 || gpio_num > 48) {
            printf("Invalid GPIO number. Use 0-48 or 'none'.\n");
            return 1;
        }
    }

    esp_err_t err = set_config_param_int("ls_gpio", gpio_num);
    if (err == ESP_OK) {
        if (gpio_num < 0) {
            printf("LED strip disabled.\n");
        } else {
            printf("LED strip set to GPIO %d.\n", gpio_num);
        }
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_led_strip(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_led_strip",
        .help = "Set GPIO for addressable LED strip (WS2812/SK6812, 'none' to disable, requires restart)",
        .hint = NULL,
        .func = &set_led_strip_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_ttl' command - set TTL override for upstream packets */
static int set_ttl_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_ttl <value>\n");
        printf("  value: 0-255 (0 = disabled, no TTL change)\n");
        printf("\nCurrent setting: %d", sta_ttl_override);
        if (sta_ttl_override == 0) {
            printf(" (disabled)\n");
        } else {
            printf("\n");
        }
        return 0;
    }

    esp_err_t err;

    // Parse argument
    char *endptr;
    long ttl_val = strtol(argv[1], &endptr, 10);
    if (*endptr != '\0' || ttl_val < 0 || ttl_val > 255) {
        printf("Invalid TTL value. Use 0-255 (0 = disabled).\n");
        return 1;
    }

    err = set_config_param_int("sta_ttl", (int32_t)ttl_val);
    if (err == ESP_OK) {
        sta_ttl_override = (uint8_t)ttl_val;
        if (ttl_val == 0) {
            ESP_LOGI(TAG, "TTL override disabled.");
            printf("TTL override disabled (no change to packets).\n");
        } else {
            ESP_LOGI(TAG, "TTL override set to %ld.", ttl_val);
            printf("TTL override set to %ld for upstream packets.\n", ttl_val);
        }
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ttl(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ttl",
        .help = "Set TTL override for upstream STA packets (0 = disabled)",
        .hint = NULL,
        .func = &set_ttl_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'client_stats' command - enable/disable per-client traffic statistics */
static int client_stats_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Per-client stats: %s\n", client_stats_enabled ? "enabled" : "disabled");
        printf("Usage: client_stats <enable|disable>\n");
        return 0;
    }

    bool enable;
    if (strcmp(argv[1], "enable") == 0) {
        enable = true;
    } else if (strcmp(argv[1], "disable") == 0) {
        enable = false;
    } else {
        printf("Usage: client_stats <enable|disable>\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("cstats_en", enable ? 1 : 0);
    if (err != ESP_OK) {
        printf("Failed to save setting\n");
        return 1;
    }
    client_stats_enabled = enable;
    printf("Per-client stats %s.\n", enable ? "enabled" : "disabled");
    return 0;
}

static void register_client_stats_cmd(void)
{
    const esp_console_cmd_t cmd = {
        .command = "client_stats",
        .help = "Enable or disable per-client traffic statistics",
        .hint = NULL,
        .func = &client_stats_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_ap_nat' command - enable or disable NAT on the AP interface */
static int set_ap_nat_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("NAT: %s\n", ap_nat_enabled ? "enabled" : "disabled (routed mode)");
        printf("Usage: set_ap_nat <on|off>  (requires restart)\n");
        return 0;
    }
    const char *mode = argv[1];
    int val;
    if (strcasecmp(mode, "on") == 0 || strcmp(mode, "1") == 0) {
        val = 1;
    } else if (strcasecmp(mode, "off") == 0 || strcmp(mode, "0") == 0) {
        val = 0;
    } else {
        printf("Usage: set_ap_nat <on|off>\n");
        return 1;
    }
    set_config_param_int("ap_nat", val);
    ap_nat_enabled = (uint8_t)val;
    printf("AP NAT %s. Restart to apply.\n", val ? "enabled" : "disabled (routed mode)");
    return 0;
}

