martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    esp_err_t err = set_config_param_int("ap_authmode", mode_val);
    if (err == ESP_OK) {
        ap_authmode = (uint8_t)mode_val;
        printf("AP auth mode set to: %s\n", modes[mode_val]);
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ap_auth(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_auth",
        .help = "Set AP auth mode (wpa2, wpa3, or wpa2wpa3; requires restart)",
        .hint = NULL,
        .func = &set_ap_auth_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'ap' command - enable/disable AP interface dynamically */
static int ap_cmd(int argc, char **argv)
{
    if (argc < 2) {
        wifi_mode_t mode = WIFI_MODE_NULL;
        esp_wifi_get_mode(&mode);
        bool running = (mode == WIFI_MODE_APSTA || mode == WIFI_MODE_AP);
        printf("AP interface: %s\n", running ? "enabled" : "disabled");
        printf("  (NVS setting: %s)\n", ap_disabled ? "disabled" : "enabled");
        printf("\nUsage:\n");
        printf("  ap enable   - Enable AP interface immediately\n");
        printf("  ap disable  - Disable AP interface immediately\n");
        return 0;
    }

    const char *action = argv[1];
    if (strcmp(action, "enable") == 0) {
        if (!ap_disabled) {
            printf("AP interface is already enabled.\n");
            return 0;
        }
        ap_set_enabled(true);
        printf("AP interface enabled.\n");
    } else if (strcmp(action, "disable") == 0) {
        if (ap_disabled) {
            printf("AP interface is already disabled.\n");
            return 0;
        }
        ap_set_enabled(false);
        printf("AP interface disabled.\n");
    } else {
        printf("Unknown action: %s\n", action);
        printf("Usage: ap <enable|disable>\n");
        return 1;
    }
    return 0;
}

static void register_ap(void)
{
    const esp_console_cmd_t cmd = {
        .command = "ap",
        .help = "Enable or disable the AP interface\n"
                "  ap          - Show current AP status\n"
                "  ap enable   - Enable AP interface\n"
                "  ap disable  - Disable AP interface",
        .hint = " <enable|disable>",
        .func = &ap_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if WIFI_HAS_5GHZ
/* 'set_sta_band' command - set STA band preference (5 GHz capable targets) */
static int set_sta_band_cmd(int argc, char **argv)
{
    if (argc < 2) {
        const char *names[] = {"auto", "2.4 GHz", "5 GHz"};
        printf("STA band preference: %s\n", names[sta_band <= STA_BAND_5G ? sta_band : 0]);
        return 0;
    }

    int band_val;
    if (strcmp(argv[1], "auto") == 0 || strcmp(argv[1], "0") == 0) {
        band_val = STA_BAND_AUTO;
    } else if (strcmp(argv[1], "2.4") == 0 || strcmp(argv[1], "1") == 0) {
        band_val = STA_BAND_2G;
    } else if (strcmp(argv[1], "5") == 0 || strcmp(argv[1], "2") == 0) {
        band_val = STA_BAND_5G;
    } else {
        printf("Invalid band. Use: auto, 2.4, or 5\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("sta_band", band_val);
    if (err == ESP_OK) {
        sta_band = (uint8_t)band_val;
        const char *names[] = {"auto", "2.4 GHz", "5 GHz"};
        printf("STA band preference set to: %s\n", names[band_val]);
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_sta_band(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_sta_band",
        .help = "Set STA band preference (auto, 2.4, 5; requires restart)",
        .hint = NULL,
        .func = &set_sta_band_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif /* WIFI_HAS_5GHZ */

/**
 * @brief Format IP address with device name for /32 addresses
 * If the IP has a full /32 mask and a matching DHCP reservation with a name,
 * returns the device name. Otherwise returns the formatted IP/mask.
 */
static char* acl_format_ip_with_name(uint32_t ip, uint32_t mask, char* buf, size_t buf_len)
{
    /* Check for "any" (0.0.0.0/0) */
    if (ip == 0 && mask == 0) {
        snprintf(buf, buf_len, "any");
        return buf;
    }

    /* For /32 addresses, try to look up device name */
    if (mask == 0xFFFFFFFF) {
        const char* name = lookup_device_name_by_ip(ip);
        if (name != NULL) {
            snprintf(buf, buf_len, "%s", name);
            return buf;
        }
    }

    /* Fall back to standard IP formatting */
    return acl_format_ip(ip, mask, buf, buf_len);
}

/**
 * @brief Parse IP address or device name for ACL rules
 * First tries to parse as IP/CIDR, then tries to resolve as device name.
 * Device names are resolved to /32 addresses.
 */
static bool acl_parse_ip_or_name(const char* str, uint32_t* ip, uint32_t* mask)
{
    /* First try standard IP parsing */
    if (acl_parse_ip(str, ip, mask)) {
        return true;
    }

    /* Try to resolve as device name (case-insensitive) */
    if (resolve_device_name_to_ip(str, ip)) {
        *mask = 0xFFFFFFFF;  /* /32 for device names */
        return true;
    }

    return false;
}

/**
 * @brief Print ACL rules with device names for /32 addresses
 */
static void acl_print_with_names(uint8_t acl_no)
{
    if (acl_no >= MAX_ACL_LISTS) {
        printf("Invalid ACL list number\n");
        return;
    }

    printf("\nACL: %s\n", acl_get_name(acl_no));
    printf("==========\n");

    acl_stats_t *stats = acl_get_stats(acl_no);
    printf("Stats: allowed=%lu, denied=%lu, no_match=%lu\n",
           (unsigned long)stats->packets_allowed,
           (unsigned long)stats->packets_denied,
           (unsigned long)stats->packets_nomatch);

    if (acl_is_empty(acl_no)) {
        printf("No rules configured (all packets allowed)\n");
        return;
    }

    printf("\n%3s  %-6s  %-20s  %-20s  %-6s  %-6s  %-8s  %s\n",
           "Idx", "Proto", "Source", "Destination", "SPort", "DPort", "Action", "Hits");
    printf("---  ------  --------------------  --------------------  ------  ------  --------  ----\n");

    /* Snapshot rules under the lock, then print outside to avoid
     * blocking packet processing (printf can block via remote console). */
    acl_entry_t rules_copy[MAX_ACL_ENTRIES];
    acl_lock();
    acl_entry_t *rules = acl_get_rules(acl_no);
    memcpy(rules_copy, rules, sizeof(rules_copy));
    acl_unlock();

    for (int i = 0; i < MAX_ACL_ENTRIES; i++) {
        acl_entry_t *rule = &rules_copy[i];
        if (!rule->valid) {
            continue;
        }

        /* Format protocol */
        const char *proto_str;
        switch (rule->proto) {
            case 0:  proto_str = "IP"; break;
            case 1:  proto_str = "ICMP"; break;
            case 6:  proto_str = "TCP"; break;
            case 17: proto_str = "UDP"; break;
            default: proto_str = "?"; break;
        }

        /* Format IP addresses with device names */
        char src_str[24], dest_str[24];
        acl_format_ip_with_name(rule->src, rule->s_mask, src_str, sizeof(src_str));
        acl_format_ip_with_name(rule->dest, rule->d_mask, dest_str, sizeof(dest_str));

        /* Format ports */
        char s_port_str[8], d_port_str[8];
        if (rule->s_port == 0) {
            strcpy(s_port_str, "*");
        } else {
            snprintf(s_port_str, sizeof(s_port_str), "%d", rule->s_port);
        }
        if (rule->d_port == 0) {
            strcpy(d_port_str, "*");
        } else {
            snprintf(d_port_str, sizeof(d_port_str), "%d", rule->d_port);
        }

        /* Format action */
        const char *action_str;
        uint8_t action = rule->allow & 0x01;
        uint8_t monitor = rule->allow & ACL_MONITOR;
        if (action == ACL_ALLOW) {
            action_str = monitor ? "allow+M" : "allow";
        } else {
            action_str = monitor ? "deny+M" : "deny";
        }

        printf("%3d  %-6s  %-20s  %-20s  %-6s  %-6s  %-8s  %lu\n",
               i, proto_str, src_str, dest_str, s_port_str, d_port_str,
               action_str, (unsigned long)rule->hit_count);
    }
}

/* 'acl' command implementation */
static int acl_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: acl <list> <action> [params...]\n");
        printf("Lists: from_esp, to_esp, from_ap, to_ap\n");
        printf("\nActions:\n");
        printf("  acl <list> clear              - Clear all rules from list\n");
        printf("  acl <list> clear_stats        - Clear statistics for list\n");
        printf("  acl <list> del <idx>          - Delete rule at index\n");
        printf("  acl <list> <proto> <src> [<s_port>] <dst> [<d_port>] <action>\n");
        printf("\nProtocols: IP, TCP, UDP, ICMP\n");
        printf("Addresses: IP/mask, 'any', or device name from DHCP reservations\n");
        printf("Ports:     Port number or '*' for any (TCP/UDP only)\n");
        printf("Actions:   allow, deny, allow_monitor, deny_monitor\n");
        printf("\nExamples:\n");
        printf("  acl from_esp clear\n");
        printf("  acl from_esp IP any 255.255.255.255 allow\n");
        printf("  acl from_esp UDP any any any 53 allow\n");
        printf("  acl from_esp TCP any 22 192.168.4.0/24 * deny\n");
        printf("  acl from_esp IP any MyPhone deny      # Use device name\n");
        printf("  acl from_esp IP any any deny          # Block all at end\n");
        printf("  acl from_esp del 0                    # Delete first rule\n");
        return 0;
    }

