martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    /* Stop connection attempts so they don't interfere with scanning */
    if (!ap_connect) {
        wifi_scan_active = true;
        esp_wifi_disconnect();
        vTaskDelay(pdMS_TO_TICKS(100));  /* Let disconnect complete */
    }

    printf("Scanning for WiFi networks...\n");
    esp_err_t err = esp_wifi_scan_start(&scan_config, true);  /* Blocking scan */

    /* Read results BEFORE clearing flag or reconnecting, so nothing
     * can interfere with the scan result buffer. */
    uint16_t ap_count = 0;
    wifi_ap_record_t *ap_list = NULL;

    if (err == ESP_OK) {
        esp_wifi_scan_get_ap_num(&ap_count);
        if (ap_count > 0) {
            ap_list = malloc(sizeof(wifi_ap_record_t) * ap_count);
            if (ap_list != NULL) {
                esp_wifi_scan_get_ap_records(&ap_count, ap_list);
            } else {
                ap_count = 0;
            }
        }
    }

    /* Now safe to resume connection attempts */
    wifi_scan_active = false;
    if (!ap_connect) {
        esp_wifi_connect();
    }

    if (err != ESP_OK) {
        printf("Scan failed: %s\n", esp_err_to_name(err));
        return 1;
    }

    if (ap_count == 0) {
        printf("No networks found.\n");
        return 0;
    }

    /* Print header */
    printf("\nFound %d networks:\n", ap_count);
#if WIFI_HAS_5GHZ
    printf("%-32s  %3s  %5s  %4s  %-12s\n", "SSID", "Ch", "Band", "RSSI", "Security");
    printf("--------------------------------  ---  -----  ----  ------------\n");

    for (int i = 0; i < ap_count; i++) {
        const char *auth = auth_mode_to_str(ap_list[i].authmode);
        printf("%-32s  %3d  %5s  %4d  %s\n", ap_list[i].ssid, ap_list[i].primary,
               ap_list[i].primary > 14 ? "5 GHz" : "2.4 G", ap_list[i].rssi, auth);
    }
#else
    printf("%-32s  %3s  %4s  %-12s\n", "SSID", "Ch", "RSSI", "Security");
    printf("--------------------------------  ---  ----  ------------\n");

    for (int i = 0; i < ap_count; i++) {
        const char *auth = auth_mode_to_str(ap_list[i].authmode);
        printf("%-32s  %3d  %4d  %s\n", ap_list[i].ssid, ap_list[i].primary, ap_list[i].rssi, auth);
    }
#endif

    free(ap_list);
    return 0;
}

static void register_scan(void)
{
    const esp_console_cmd_t cmd = {
        .command = "scan",
        .help = "Scan for available WiFi networks",
        .hint = NULL,
        .func = &scan_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
